# ImportAdtEntityStructType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ImportAdtEntityStructType Property
ParameterTypeId Class See Also
---
"Structural Type Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ImportAdtEntityStructType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportAdtEntityStructType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ImportAdtEntityStructType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace